STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_Peripheral/STM32_BLE/App/app_ble.c
static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */


/**
* @brief Request to cancel advertising.
*
* This function sets a task to cancel advertising.
*
* @param arg Pointer to the argument (not used in this function).
*
*/
static void Adv_Cancel_Req(void *arg)
{
  APP_DBG_MSG("Adv_Cancel_Req\n");
  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_CANCEL_ID, CFG_SEQ_PRIO_0);
  return;
}

/**
* @brief Switch off the GPIO (LED).
*
* This function turns off the green LED.
*
* @param arg Pointer to the argument (not used in this function).
*/
static void Switch_OFF_GPIO(void *arg)
{
  BSP_LED_Off(LED_GREEN);
  return;
}

/**
* @brief Cancel the advertising process.
*
* This function stops the advertising process and updates the device connection
* status to idle. It also turns off the green LED to indicate that advertising
* has been stopped.
*
* @note This function is specific to CFG_TASK_ADV_CANCEL_ID.
*/
static void Adv_Cancel(void)
{
  BSP_LED_Off(LED_GREEN);

  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
  bleAppContext.Device_Connection_Status = APP_BLE_IDLE;  
  return;
}


/**
* @brief Configures the filter list and sets up advertising with the filter list enabled.
* 
* Specific implementation for CFG_TASK_CONFIGURE_FILTER_LIST_AND_NEW_ADV.
* This function handles the configuration of the filter list and the advertising parameters.
* It performs the following steps:
* - Adds the bonded device identity address and type to the controller's filter list and the list of address translations used to resolve resolvable private addresses.
* - Sets the device privacy mode for each bonded device.
* - Configures the advertising parameters to use the filter list for scan and connection requests.
* - Sets the advertising data and scan response data.
* - Enables advertising with the configured parameters.
* 
* @retval None
*/
static void Configure_Filter_List(void)
{
  uint8_t status = 0;
  Advertising_Set_Parameters_t Advertising_Set_Parameters = {0};
  
  if(bleAppContext.Device_Connection_Status == APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER)
  {
    APP_DBG_MSG(" (FILTER) Advertising is already running...\n");
    return;
  }    
  
  if(bleAppContext.Device_Connection_Status == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status == APP_BLE_ADV_LP)
  {
    APP_DBG_MSG(" Advertising is already running...\n");
    return;
  }
  
  /**
  * Add the bonded device identity address and type to the Bluetooth Low Energy device controller filter list and 
  * to the list of address translations used to resolve resolvable private addresses in the controller
  */
  status = aci_gap_configure_filter_accept_and_resolving_list(0x01 | 0x02);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gap_configure_filter_accept_and_resolving_list(), error:0x%02X\n", status);
    return;
  } 
  else
  {
    APP_DBG_MSG("  Success: aci_gap_configure_filter_accept_and_resolving_list\n");
    
    /* Check if there are any bonded devices */
    if (Get_Num_Bonded_Devices() == 0)
    {
      APP_DBG_MSG("No bonded device found - No Advertising with filter list started.\n");
      return;
    }
    
    Print_Bonded_Devices();
    
    
    /* Configure advertising for filtering */
    status = aci_gap_set_advertising_configuration(0,
                                                   GAP_MODE_NON_DISCOVERABLE,
                                                   ADV_TYPE,
                                                   ADV_INTERVAL_MIN,
                                                   ADV_INTERVAL_MAX,
                                                   HCI_ADV_CH_ALL,
                                                   0,
                                                   NULL, /* No peer address */
                                                   HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT,
                                                   0, /* 0 dBm */
                                                   HCI_PHY_LE_1M, /* Primary advertising PHY */
                                                   0, /* 0 skips */
                                                   HCI_PHY_LE_1M, /* Secondary advertising PHY. Not used with legacy advertising. */
                                                   0, /* SID */
                                                   0 /* No scan request notifications */);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_advertising_configuration (GAP_MODE_NON_DISCOVERABLE) - fail, result: 0x%02X\n", status);
      return;
    }
    else
    {
      bleAppContext.Device_Connection_Status = APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER;
      APP_DBG_MSG("==>> Success: aci_gap_set_advertising_configuration (GAP_MODE_NON_DISCOVERABLE)\n");
    }
    
    /* Set the advertising data */
    a_AdvData[2] = FLAG_BIT_BR_EDR_NOT_SUPPORTED;
    status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, 0x3, (uint8_t*) a_AdvData);
    APP_DBG_MSG("a_AdvData[2] = FLAG_BIT_BR_EDR_NOT_SUPPORTED;\n");
    
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_advertising_data Failed (FILTER), result: 0x%02X\n", status);
      return;
    }
    else
    {
      APP_DBG_MSG("==>> Success: aci_gap_set_advertising_data (FILTER)\n");
    }
    
    status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_advertising_enable Failed (FILTER), result: 0x%02X\n", status);
    }
    else
    {
      APP_DBG_MSG("==>> Success: aci_gap_set_advertising_enable (FILTER)\n");
    }
  }
  
  return;
}

/**
* @brief Terminates the connection.
* 
* This function is the specific implementation for CFG_TASK_TERMINATE_CONNECTION.
* It terminates the current BLE connection with the error message BLE_ERROR_TERMINATED_LOCAL_HOST.
*
* @return void
*/
static void Terminate_Connection(void)
{
  uint32_t status = aci_gap_terminate(bleAppContext.BleApplicationContext_legacy.connectionHandle, BLE_ERROR_TERMINATED_REMOTE_USER);
  
  /* Check if the termination command was successful */
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_terminate failure: reason=0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_terminate : Success\n");
    
    /* Wait for the HCI_DISCONNECTION_COMPLETE_EVT_CODE event */
    gap_cmd_resp_wait();
  }
  return;
}

/**
* @brief Fill the advertising data with specific information.
*
* This function fills the advertising data with specific information such as the
* manufacturer-specific data and the complete local name. It also converts parts
* of the Bluetooth device address into ASCII characters and inserts them into the
* advertising data.
*
* @param p_adv_data Pointer to the advertising data array.
* @param tab_size Size of the advertising data array.
* @param p_bd_addr Pointer to the Bluetooth device address.
*/
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t* p_bd_addr)
{
  uint16_t i =0;
  uint8_t bd_addr_1, bd_addr_0;
  uint8_t ad_length, ad_type;  
  
  while(i < tab_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
    
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_COMPLETE_LOCAL_NAME:
      {
        if((p_adv_data[i + ad_length] == 'X') && (p_adv_data[i + ad_length - 1] == 'X'))
        {
          bd_addr_1 = ((p_bd_addr[0] & 0xF0)>>4);
          bd_addr_0 = (p_bd_addr[0] & 0xF);
          
          /* Convert hex value into ascii */
          if(bd_addr_1 > 0x09)
          {
            p_adv_data[i + ad_length - 1] = bd_addr_1 + '7';
          }
          else
          {
            p_adv_data[i + ad_length - 1] = bd_addr_1 + '0';
          }
          
