STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_Peripheral/STM32_BLE/App/app_ble.c
          if(bd_addr_0 > 0x09)
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '7';
          }
          else
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '0';
          }
        }
        break;
      }
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        p_adv_data[i+2] = ST_MANUF_ID_LSB;
        p_adv_data[i+3] = ST_MANUF_ID_MSB;
        p_adv_data[i+4] = BLUESTSDK_V2; /* blueST SDK version */
        p_adv_data[i+5] = BOARD_ID_NUCLEO_WB0; /* Board ID */
        p_adv_data[i+6] = FW_ID_MC_PERIPHERAL; /* FW ID */
        p_adv_data[i+7] = FW_ID_MC_PERIPHERAL_D1; /* FW data 1 */
        p_adv_data[i+8] = FW_ID_MC_PERIPHERAL_D2; /* FW data 2 */
        p_adv_data[i+9] = FW_ID_MC_PERIPHERAL_D3; /* FW data 3 */
        p_adv_data[i+10] = p_bd_addr[5]; /* MSB BD address */
        p_adv_data[i+11] = p_bd_addr[4];
        p_adv_data[i+12] = p_bd_addr[3];
        p_adv_data[i+13] = p_bd_addr[2];
        p_adv_data[i+14] = p_bd_addr[1];
        p_adv_data[i+15] = p_bd_addr[0]; /* LSB BD address */
        break;
      }
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}

/**
* @brief  Prints the list of bonded devices.
* 
* This function retrieves and prints the list of bonded devices. It iterates through all bonded devices
* and prints their address type and address. If no bonded devices are found, it prints a message indicating
* that there are no bonded devices.
* 
* @retval None
*/
void Print_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  APP_DBG_MSG("Bonded devices:\n");
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices)
    {
      APP_DBG_MSG("Type %d, @:%02X:%02X:%02X:%02X:%02X:%02X\n", bonded_device.Address_Type, bonded_device.Address[5], bonded_device.Address[4], bonded_device.Address[3], bonded_device.Address[2], bonded_device.Address[1], bonded_device.Address[0]);
    }
    else {
      break;
    }    
    num_bonded_devices += num_returned_devices;    
  }
  
  if(num_bonded_devices == 0){
    
    APP_DBG_MSG("No bonded devices.\n");
  }
}

/**
* @brief  Retrieves the number of bonded devices.
* 
* This function iterates through all bonded devices and counts the total number of bonded devices.
* 
* @retval uint8_t  The total number of bonded devices.
*/
uint8_t Get_Num_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices == 0){
      break;
    }
    num_bonded_devices += num_returned_devices;    
  }
  
  return num_bonded_devices;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)


/**
* @brief  Handles the action for TASK_BUTTON_1 press event.
* 
* This function is called when B1 is pressed. If the device is idle, it starts advertising
* to accept a connection and starts a timer to stop advertising after a specified timeout.
* If the device is connected as a server, it sets a task to send a notification.
* 
* @retval None
*/
void APPE_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    APP_DBG_MSG(" Device Connection Status : Connected as Server\n");
    return;
  }
  else
  {
    if (bleAppContext.Device_Connection_Status == APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER)
    {
      /* When a user presses push1, if the peripheral is in non-discoverable advertising mode 
      * with the filter list active, I need to stop the current advertising to allow the start 
      * of advertising in general discovery mode so that new centrals that are not yet bonded 
      * can connect to the peripheral.
      */
      Adv_Cancel();
    }
    if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
    {
      /* Start to Advertise to accept a connection */
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
      
      /* Start a timer to stop advertising after a while */
      HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id, ADV_TIMEOUT_MS);
    }
    else if (bleAppContext.Device_Connection_Status == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status == APP_BLE_ADV_LP)
    {
      APP_DBG_MSG("  Advertising is already running\n");
    }
  }
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_2 press event.
* 
* This function is called when Button 2 (B2) is pressed. If the device is connected as a BLE server,
* it sets a new task to send a notification to the already connected central device. Otherwise, it
* calls the function to clear the security database.
* 
* @retval None
*/
void APPE_Button2Action(void)
{
  /*  Check if the device is connected as a BLE server */
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    /* Set a task to send a notification to the central device */
    UTIL_SEQ_SetTask(1 << CFG_TASK_SEND_NOTIF_ID, CFG_SEQ_PRIO_0);
  }
  else
  {
    /* Clear the security database if not connected as a BLE server */
    tBleStatus ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_3 press event.
* 
* This function is called when Button 3 (B3) is pressed. If the device is connected as a server,
* it terminates the connection.
* 
* @retval None
*/
void APPE_Button3Action(void)
{
  // Check if the device is connected as a BLE server
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    /* Use this task to terminate the connection. This ensures that the disconnection reason is set 
    to BLE_ERROR_TERMINATED_REMOTE_USER */
    UTIL_SEQ_SetTask(1U << CFG_TASK_TERMINATE_CONNECTION, CFG_SEQ_PRIO_0);
  }
  return;
}

void APPE_Button1LongPressAction(void)
{
  APP_DBG_MSG("  In Peripheral Role, the long push button is not assigned to any action. Please use the normal push button. \n");
  return;
}

void APPE_Button2LongPressAction(void)
{
  APP_DBG_MSG("  In Peripheral Role, the long push button is not assigned to any action. Please use the normal push button. \n");
  return;
}

void APPE_Button3LongPressAction(void)
{
  APP_DBG_MSG("  In Peripheral Role, the long push button is not assigned to any action. Please use the normal push button. \n");
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
